#+TITLE:Syllabus - Introduction to programming in C++
#+AUTHOR:Marcus Birkenkrahe
#+SUBTITLE:Syllabus - CSC 100 - Lyon College - Spring 2025
#+STARTUP: overview hideblocks indent
#+OPTIONS: toc:nil num:nil ^:nil
#+PROPERTY: header-args:R :session *R* :results output :exports both :noweb yes#+PROPERTY: header-args:python :session *Python* :results output :exports both :noweb yes#+PROPERTY: header-args:C :main yes :includes <stdio.h> :results output :exports both :noweb yes#+PROPERTY: header-args:C++ :main yes :includes <iostream> :results output :exports both :noweb yes
* Schedule and session content

For *important dates*, see the 2024-2025 Academic Calendar at:
[[https://catalog.lyon.edu/202425-academic-calendar][catalog.lyon.edu/202425-academic-calendar]].

*Workload:* approx. 4-5 hours per week.
1. Class time = 16 * 3 * 50/60 = 40 hours
2. Tests (home) = 15 * .5 = 7.5 hours
3. Programming assignments: 15 * 1 = 15 hrs
4. Reading assignments (not graded): 15 * 2 = 30 hrs

Total approx. 95 hours (of which 55 hours = class time)

Let's compute the workload outside of class as the total number of
hours spent outside of class divided by the number of weeks in term:
#+begin_src C :main yes :includes <stdio.h>
  int weeks = 16;
  int classes = 3;
  int assignments = 14;
  int tests = 15;
  float session_minutes = 50.f/60.f;
  float total_hrs, class_time, workload;

  class_time = weeks * classes * session_minutes;
  printf("Class time: %g\n",class_time);

  


#+end_src

#+RESULTS:
: Class time: 40


